In [6]:
import pandas as pd

In [30]:
import numpy as np

In [10]:
obj = pd.Series([4, 7, -5, 3])

In [13]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [14]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [15]:
obj.index # como range (4)

RangeIndex(start=0, stop=4, step=1)

In [18]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])

In [19]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [20]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [21]:
# index 'a' está na linha de -5.
obj2 ['a']

-5

In [24]:
# Alterei o valor de 4 para 6 no index 'd'.
obj2 ['d'] = 6

In [25]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

 Nesse caso, ['c', 'a', 'd'] é interpretado como uma lista de índices, apesar de conter strings em vez de inteiros.

In [27]:
# -5 não é maior que > 0 então não irá aparecer.
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [28]:
#  Multiplicando os valores:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [31]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [32]:
# Conferindo se está na variável
'b' in obj2

True

In [33]:
'e' in obj2

False

In [34]:
# Se você tiver dados contidos em um dicionário python, uma series poderá ser criada a partir dele, passando-lhe o dicionário:

sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000 }

In [35]:
obj3 = pd.Series(sdata)

In [36]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [37]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [38]:
obj4 = pd.Series(sdata, index=states)

In [40]:
# Imprimindo na ordem que escrevi: 
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [42]:
# California com valor nulo:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [43]:
# Que não tem valor nulo:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [47]:
# Uma Series também tem esses métodos como métodos de instância: 

obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [48]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [49]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [50]:
# Unir valores das duas variáveis:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [51]:
obj4.name = 'population'

In [52]:
obj4.index.name = 'state'

In [53]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [54]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [55]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [56]:
# Um índice de Series pode ser alterado in-place por atribuição:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [57]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [58]:
# Exibindo dataframe de acordo com os valores e nome:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [64]:
# Para DataFrames grandes, o método head selecionará somente as primeiras cinco linhas:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [65]:
# Exibir na sequência que escrevi:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [66]:
# Se você passar uma coluna que não esteja contida no dicionário, ela aparecerá com valores ausentes no resultado:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                     index=['one', 'two', 'three', 'four',
                           'five', 'six'])

In [67]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [68]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [69]:
#Uma coluna em um DataFrame pode ser obtida como uma Series, seja usando uma notação do tipo dicionário ou por meio de atributo:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [70]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64